result_Artillery/artsinlog.txt
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.0": 50,
      "vusers.created": 50,
      "http.requests": 1000,
      "http.codes.200": 1000,
      "http.responses": 1000,
      "vusers.failed": 0,
      "vusers.completed": 50
    },
    "rates": {
      "http.request_rate": 500
    },
    "firstCounterAt": 1659660110900,
    "firstHistogramAt": 1659660110917,
    "lastCounterAt": 1659660111909,
    "lastHistogramAt": 1659660111909,
    "firstMetricAt": 1659660110900,
    "lastMetricAt": 1659660111909,
    "period": 1659660110000,
    "summaries": {
      "http.response_time": {
        "min": 0,
        "max": 3,
        "count": 1000,
        "p50": 1,
        "median": 1,
        "p75": 1,
        "p90": 2,
        "p95": 2,
        "p99": 3,
        "p999": 3
      },
      "vusers.session_length": {
        "min": 22.8,
        "max": 58.4,
        "count": 50,
        "p50": 28.5,
        "median": 28.5,
        "p75": 30.9,
        "p90": 32.8,
        "p95": 35.5,
        "p99": 41.7,
        "p999": 41.7
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 0,
        "max": 3,
        "count": 1000,
        "p50": 1,
        "median": 1,
        "p75": 1,
        "p90": 2,
        "p95": 2,
        "p99": 3,
        "p999": 3
      },
      "vusers.session_length": {
        "min": 22.8,
        "max": 58.4,
        "count": 50,
        "p50": 28.5,
        "median": 28.5,
        "p75": 30.9,
        "p90": 32.8,
        "p95": 35.5,
        "p99": 41.7,
        "p999": 41.7
      }
    }
  },
  "intermediate": []
}